public class Visualization {
    /** Класс визуализации: графики, таблицы
     * Все файлы изначально загружаются со всеми столбцами, предлагамыми, финамом.
     * Название инструмента, период(в минутах), дата(гггг-мм-чч), время(чч-мм-сс), цена открытия, ц.закрытия,
     * максимальная ц., минимальная ц., ц.закрытия, объем торгов
     */
    void avg(){
    }

    /** Средняя цена за период
     *
     */

    void open(){}
    /** цена открытия
     *
     */

    void close(){}
    /** Цена закрытия
     *
     */

    void high(){}
    /** Наибольшая цена
     *
     */

    void low(){}
    /** наименьшая цена
     *
     */

    void volume(){}
    /** Объем торгов
     *
     */

    void showTable(){}
    /** Показывает данные в виде таблицы
     *
     */
}
